In [6]:
import pandas as pd
import os

In [8]:
employees_2025  = pd.read_csv("bpi_employee_roster_fa_25.csv")
employees_2025.head()
employees_2025_short = employees_2025[["employee_id", "first_name", "last_name"]]

def extract_middle_name(first_name):
    parts = str(first_name).split()
    if len(parts) > 1:
        return ' '.join(parts[1:])
    return ''

def extract_first_name(first_name):
    parts = str(first_name).split()
    return parts[0] if parts else ''

employees_2025_short['middle_name'] = employees_2025_short['first_name'].apply(extract_middle_name)
employees_2025_short['first_name'] = employees_2025_short['first_name'].apply(extract_first_name)
employees_2025_short.head()

   employee_id first_name last_name middle_name
0         2277    Patrick    Santry           B
1         7442    Richard  Guilford
2         7546     Gerald   Ajemian           F
3         7700       John    Mullan           P
4         8010      James   Hawkins           D

In [12]:
employees_all = pd.read_csv("incident_with_employee_ids.csv")
employees_all.head()

,Unnamed: 0,Inc: IA No,Inc: Incident type,Inc: Received date,Inc: Occurred date,OffSnp: Title/rank,Off: First name,Off: Last name,Alg: Allegation,Alg: Finding,Act: Action taken,Act: Days/hours suspended,Act: Action taken date,First_Name,Middle_Initial,Incident Year,Full Name,Employee ID
0,0,IAD2011-0003,Citizen complaint,01/05/2011,06/18/2009,Sergeant Detective,Albert M,Terestre,Use of Force,Exonerated,NaN,0.0,NaN,Albert,M,2011,Albert M Terestre,10002
1,1,IAD2011-0003,Citizen complaint,01/05/2011,06/18/2009,Police Officer,John K,Rogers,Use of Force,Exonerated,NaN,0.0,NaN,John,K,2011,John K Rogers,11357
2,8,IAD2011-0013,Citizen complaint,01/07/2011,10/27/2010,Police Officer,Andrew B,Blake,Respectful Treatment,Not Sustained,NaN,NaN,NaN,Andrew,B,2011,Andrew B Blake,12104
3,16,IAD2011-0023,Citizen complaint,01/14/2011,11/01/2012,Detective,Laura A,Delaney,Neg.Duty/Unreasonable Judge,Sustained,Oral Reprimand,NaN,06/21/2012,Laura,A,2011,Laura A Delaney,11676
4,21,IAD2011-0039,Citizen complaint,01/22/2011,01/22/2011,Police Officer,Richard L,Medina,Self Identification,Exonerated,NaN,0.0,NaN,Richard,L,2011,Richard L Medina,12131

In [ ]:
bpi_police_financial = pd.read_csv("bpi_police_financial.csv")
employees_2025_short_joined = employees_2025_short.merge(bpi_police_financial, on="employee_id", how="left")
employees_2025_short_joined.head(10)

,employee_id,first_name_x,last_name_x,middle_name,bpi_id,badge_no,last_name_y,first_name_y,rank,unit,...,retro_pay,other_pay,ot_pay,injured_pay,detail_pay,quinn_pay,total_pay,year,rank_bucket,total_pay_percentile
0,2277,Patrick,Santry,B,59e7880e-f51f-4a93-b9b4-306b13acecb4,747.0,Santry,Patrick,Police Sergeant,Medically Incapacitated Unit,...,NaN,46389.29,NaN,19053.14,NaN,4763.31,70205.74,2021.0,Sergeant,6.266491
1,2277,Patrick,Santry,B,59e7880e-f51f-4a93-b9b4-306b13acecb4,747.0,Santry,Patrick,Police Sergeant,Medically Incapacitated Unit,...,0.00,10221.41,46946.74,0.00,0.0,12615.05,159830.18,2011.0,Sergeant,67.773380
2,2277,Patrick,Santry,B,59e7880e-f51f-4a93-b9b4-306b13acecb4,747.0,Santry,Patrick,Police Sergeant,Medically Incapacitated Unit,...,0.00,11851.22,49594.36,0.00,1188.0,11251.02,163891.33,2012.0,Sergeant,70.188361
3,2277,Patrick,Santry,B,59e7880e-f51f-4a93-b9b4-306b13acecb4,747.0,Santry,Patrick,Police Sergeant,Medically Incapacitated Unit,...,0.00,10221.41,54040.48,0.00,4336.0,11256.05,169900.91,2013.0,Sergeant,73.383905
4,2277,Patrick,Santry,B,59e7880e-f51f-4a93-b9b4-306b13acecb4,747.0,Santry,Patrick,Police Sergeant,Medically Incapacitated Unit,...,NaN,5343.24,68683.69,NaN,NaN,20678.53,204990.21,2016.0,Sergeant,86.276019
5,2277,Patrick,Santry,B,59e7880e-f51f-4a93-b9b4-306b13acecb4,747.0,Santry,Patrick,Police Sergeant,Medically Incapacitated Unit,...,0.00,8412.60,74590.59,0.00,0.0,19889.76,212684.79,2015.0,Sergeant,87.932425
6,2277,Patrick,Santry,B,59e7880e-f51f-4a93-b9b4-306b13acecb4,747.0,Santry,Patrick,Police Sergeant,Medically Incapacitated Unit,...,NaN,14329.73,69204.80,NaN,NaN,20500.59,213370.87,2017.0,Sergeant,88.053357
7,2277,Patrick,Santry,B,59e7880e-f51f-4a93-b9b4-306b13acecb4,747.0,Santry,Patrick,Police Sergeant,Medically Incapacitated Unit,...,33156.97,4797.58,72899.36,0.00,176.0,15300.38,224579.02,2014.0,Sergeant,90.167839
8,2277,Patrick,Santry,B,59e7880e-f51f-4a93-b9b4-306b13acecb4,747.0,Santry,Patrick,Police Sergeant,Medically Incapacitated Unit,...,16291.35,13699.68,64631.90,NaN,1908.0,26045.78,238803.36,2018.0,Sergeant,92.780709
9,7442,Richard,Guilford,,783f18e5-d754-44f8-ac78-08164c13361a,3341.0,Guilford,Richard,Police Officer,Medically Incapacitated Unit,...,0.00,800.00,7781.03,0.00,9382.0,9764.77,97428.99,2011.0,Officer,16.761947

In [ ]:
# Join with employees_all and keep only specified columns
final_df = employees_2025_short_joined.merge(employees_all, left_on="employee_id", right_on="Employee ID", how="left")

# Select only the desired columns
salary_cols = ['regular_pay', 'retro_pay', 'other_pay', 'ot_pay', 'injured_pay', 'detail_pay', 'quinn_pay', 'total_pay']
cols_to_keep = ['first_name_x', 'last_name_x', 'middle_name', 'employee_id', 'Zip Code'] + salary_cols

final_df_selected = final_df[cols_to_keep].copy()
final_df_selected.columns = ['first_name', 'last_name', 'middle_name', 'employee_id', 'zip_code', 'regular_pay', 'retro_pay', 'other_pay', 'ot_pay', 'injured_pay', 'detail_pay', 'quinn_pay', 'total_pay']

final_df_selected

,first_name,last_name,middle_name,employee_id,regular_pay,retro_pay,other_pay,ot_pay,injured_pay,detail_pay,quinn_pay,total_pay
0,Patrick,Santry,B,2277,NaN,NaN,46389.29,NaN,19053.14,NaN,4763.31,70205.74
1,Patrick,Santry,B,2277,90046.98,0.0,10221.41,46946.74,0.00,0.0,12615.05,159830.18
2,Patrick,Santry,B,2277,90006.73,0.0,11851.22,49594.36,0.00,1188.0,11251.02,163891.33
3,Patrick,Santry,B,2277,90046.97,0.0,10221.41,54040.48,0.00,4336.0,11256.05,169900.91
4,Patrick,Santry,B,2277,110284.75,NaN,5343.24,68683.69,NaN,NaN,20678.53,204990.21
...,...,...,...,...,...,...,...,...,...,...,...,...
59411,Lenin,Ortiz,,99789,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59412,Scott,Lucas,D.,99790,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59413,Lakenya,Webster,L.,99796,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59414,Michael,Holden,D.,99799,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59415,Gregory,Mcpherson,A.,99801,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
# Split into two separate tables
# Table 1: Employee information
employees_table = final_df_selected[['employee_id', 'first_name', 'last_name', 'middle_name', 'zip_code']].drop_duplicates()
print("Employee Information Table:")
employees_table.shape

Employee Information Table:

(2767, 4)

In [23]:
# Table 2: Salary information
salary_table = final_df_selected[['employee_id', 'regular_pay', 'retro_pay', 'other_pay', 'ot_pay', 'injured_pay', 'detail_pay', 'quinn_pay', 'total_pay']]
print("\nSalary Information Table:")
salary_table

Salary Information Table:

,employee_id,regular_pay,retro_pay,other_pay,ot_pay,injured_pay,detail_pay,quinn_pay,total_pay
0,2277,NaN,NaN,46389.29,NaN,19053.14,NaN,4763.31,70205.74
1,2277,90046.98,0.0,10221.41,46946.74,0.00,0.0,12615.05,159830.18
2,2277,90006.73,0.0,11851.22,49594.36,0.00,1188.0,11251.02,163891.33
3,2277,90046.97,0.0,10221.41,54040.48,0.00,4336.0,11256.05,169900.91
4,2277,110284.75,NaN,5343.24,68683.69,NaN,NaN,20678.53,204990.21
...,...,...,...,...,...,...,...,...,...
59411,99789,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59412,99790,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59413,99796,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59414,99799,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59415,99801,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [25]:
# Save to separate CSV files without index
employees_table.to_csv('employees_2025_info.csv', index=False)
salary_table.to_csv('employees_2025_salary.csv', index=False)

print("Saved employees_2025_info.csv")
print("Saved employees_2025_salary.csv")

Saved employees_2025_info.csv
Saved employees_2025_salary.csv

In [26]:
# Create all-years tables using bpi_police_financial data
# First, merge police financial with employees_all to get complete info
all_years_data = bpi_police_financial.merge(employees_all[['Employee ID', 'First_Name', 'Middle_Initial']], left_on='employee_id', right_on='Employee ID', how='left')

# Table 1: All employee information (unique employees)
all_employees_table = all_years_data[['employee_id', 'first_name', 'last_name', 'Zip Code']].drop_duplicates()
all_employees_table.columns = ['employee_id', 'first_name', 'last_name', 'zip_code']

# Table 2: All salary information (with year)
all_salary_table = all_years_data[['employee_id', 'year', 'regular_pay', 'retro_pay', 'other_pay', 'ot_pay', 'injured_pay', 'detail_pay', 'quinn_pay', 'total_pay']]

# Save to CSV files without index
all_employees_table.to_csv('employees_all_info.csv', index=False)
all_salary_table.to_csv('employees_all_salary.csv', index=False)

print("Saved employees_all_info.csv")
print("Saved employees_all_salary.csv")
print(f"Total employees: {len(all_employees_table)}")
print(f"Total salary records: {len(all_salary_table)}")

Saved employees_all_info.csv
Saved employees_all_salary.csv
Total employees: 4570
Total salary records: 58488